/* Tree-shaking --------------------------------------------------------------------------------------------------------- */
// 上下文未用到的程式碼(dead code)
// 基於ES6 import export
// package.json "sideEffects" 該屬性是不想被tree-shaking的範圍設定
// Babel的module設置要為false
ex: 
"sideEffects": [
  "*.css",
]

/* js壓縮 --------------------------------------------------------------------------------------------------------- */
// terser-webpack-plugin 

/* 作用域提升scope hoisting --------------------------------------------------------------------------------------------------------- */
// 程式碼體積減小
// 提高執行效率
// Babel的module設置要為false

/* babel 設定 --------------------------------------------------------------------------------------------------------- */
// polyfill的需要加載
presets: [
  [{
    "useBuiltIns": "usage",
  }]
]
// 輔助函數的複用
plugins: [  
  "@babel/plugin-transform-runtime",
]
